ci4/app/Models/Iuran_Model.php

    public function getiuran($id = false)
    {
        if($id === false){
            return $this->findAll();
---
SELECT *
FROM `iuran`