ci4/app/Models/Warga_Model.php

    public function getwarga($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `warga`
SELECT *
FROM `warga`
WHERE `id` = '14'

    public function hapuswarga($id)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['id' => $id]);
---
DELETE FROM `warga`
WHERE `id` = '14'